1. __Count non-missing values by groups__

In [4]:
import pandas as pd
import numpy as np
data = { 'user_id': list(range(1,11,1)),
        'group':[1 if i < 5 else 2 for i in range(10)],
    'qualified_date':['2017-01-17','2018-01-03','2018-01-11',np.nan,np.nan,'2018-01-15','2018-01-7','2018-01-23','2018-01-25','2018-01-11'],
        'loyal_date':['2018-02-03','2018-01-12',np.nan,np.nan,np.nan,'2018-02-14',np.nan,'2018-02-15',np.nan,'2018-03-01']
       }

df= pd.DataFrame(data, columns = ['user_id','group','qualified_date', 'loyal_date'])
df[['qualified_date','loyal_date']]=df[['qualified_date','loyal_date']].apply(lambda x: pd.to_datetime(x))

In [19]:
df.head()

   user_id  group qualified_date loyal_date
0        1      1     2017-01-17 2018-02-03
1        2      1     2018-01-03 2018-01-12
2        3      1     2018-01-11        NaT
3        4      1            NaT        NaT
4        5      1            NaT        NaT

In [20]:
cols = ['qualified_date', 'loyal_date']
df.groupby('group')[cols].agg('count').add_suffix("_count").reset_index()

   group  qualified_date_count  loyal_date_count
0      1                     3                 2
1      2                     5                 3

2 . ** Take difference between two column of pandas dataframe based on condition in python **

In [30]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'code': [101, 102, 103, 105, 107, 110],
                   'apple price': [101, 123, np.nan, 123, 165, 123],
                   'mangoes price': [np.nan, 123, np.nan, 167, np.nan, np.nan],
                   'watermelon price': [np.nan, np.nan, np.nan, np.nan, 177, np.nan],
                   'market price': [122, 124, 123, 154, 176, 123]})
df

   apple price  code  mangoes price  market price  watermelon price
0        101.0   101            NaN           122               NaN
1        123.0   102          123.0           124               NaN
2          NaN   103            NaN           123               NaN
3        123.0   105          167.0           154               NaN
4        165.0   107            NaN           176             177.0
5        123.0   110            NaN           123               NaN

I want to take compare the price of column "market price" and each of the other columns like "apple price","mangoes price", "watermelon price" but prioritize the difference based on the condition : (First priority is watermelon price, second to mangoes and third for apple). Here the first row has just apple price and market price then take their diff, but in second row, we have apple, mangoes price so i have to take only the difference between market price and mangoes price. likewise take the difference based on priority condition. Also skip the rows with nan for all three prices.   
The ** idea is to calculate the differences and overwrite them according to your priority list. **

In [31]:
#Calculate difference to apple price
df['diff'] = df['market price'] - df['apple price']
# Overwrite with difference to mangoes price
df['diff'] = df.apply(lambda x: x['market price'] - x['mangoes price'] if not np.isnan(x['mangoes price']) else x['diff'], axis=1)
# Overwrite with difference to watermelon price
df['diff'] = df.apply(lambda x: x['market price'] - x['watermelon price'] if not np.isnan(x['watermelon price']) else x['diff'], axis=1)
print(df)

   apple price  code  mangoes price  market price  watermelon price  diff
0        101.0   101            NaN           122               NaN  21.0
1        123.0   102          123.0           124               NaN   1.0
2          NaN   103            NaN           123               NaN   NaN
3        123.0   105          167.0           154               NaN -13.0
4        165.0   107            NaN           176             177.0  -1.0
5        123.0   110            NaN           123               NaN   0.0

3 . ** Subset pandas data frame both on columns and row **   
eg.: Project: A New Era of Data Analysis in Baseball in Datacamp

In [32]:
import pandas as pd
from random import randint,seed
df = pd.DataFrame({'A': [randint(1, 9) for x in range(10)],
                   'B': [randint(1, 9)*10 for x in range(10)],
                   'C': [randint(1, 9)*100 for x in range(10)]})
seed(123)
df

   A   B    C
0  1  60  100
1  5  60  700
2  2  10  200
3  7  30  700
4  5  30  200
5  2  60  100
6  1  90  600
7  7  60  800
8  9  40  200
9  9  30  100

We can apply column operations and get boolean Series objects:

In [33]:
df["B"] > 50

0     True
1     True
2    False
3    False
4    False
5     True
6     True
7     True
8    False
9    False
Name: B, dtype: bool

In [34]:
df[(df["B"] > 50) & (df["C"] > 200)]

   A   B    C
1  5  60  700
6  1  90  600
7  7  60  800

Now we can extract A column only

In [35]:
df['A'][(df["B"] > 50) & (df["C"] >200)]

1    5
6    1
7    7
Name: A, dtype: int64

## We better used loc instead

In [36]:
df.loc[(df["B"] > 50) & (df["C"] >200),'A']

1    5
6    1
7    7
Name: A, dtype: int64

** Another option with iloc and query **

In [37]:
my_query_index = df.query('B > 50 & C > 200').index

In [38]:
df=df.iloc[my_query_index,0]
df.value_counts

<bound method IndexOpsMixin.value_counts of 1    5
6    1
7    7
Name: A, dtype: int64>

4 . **Count number of rows by groups in pandas dataframe**   
    A simplest way is calling .size(), which returns a pandas.Series. Further example can refer [here]("https://www.shanelynn.ie/summarising-aggregation-and-grouping-data-in-python-pandas/")

In [5]:
df = pd.DataFrame({'col1':['A','A','A','A','C','C','C','E','E','G'],
     'col2':['B','B','B','B','D','D','D','F','F','H'],
     'col3':[12,5,3,4,1,5,7,9,4,8]})
df

  col1 col2  col3
0    A    B    12
1    A    B     5
2    A    B     3
3    A    B     4
4    C    D     1
5    C    D     5
6    C    D     7
7    E    F     9
8    E    F     4
9    G    H     8

In [6]:
df.groupby(['col1', 'col2']).size()

col1  col2
A     B       4
C     D       3
E     F       2
G     H       1
dtype: int64

Create a new data frame with **counts columns**

In [7]:
df.groupby(['col1', 'col2']).size().reset_index(name='counts')

  col1 col2  counts
0    A    B       4
1    C    D       3
2    E    F       2
3    G    H       1